In [1]:
import pandas as pd
import numpy as np
import re
from bs4 import BeautifulSoup
import requests

pd.options.display.max_columns = None

In [2]:
url = 'https://sofifa.com/players?type=all&oal=75&vlh=0'
html = requests.get(url)
soup = BeautifulSoup(html.content, "html.parser")
html.status_code

200

In [3]:
productos = soup.find_all("td",{"class": "col col-ae"})

In [4]:
edades = {'edad': []}

In [5]:
for i in productos:
    edades['edad'].append(i)

In [6]:
jedad = pd.DataFrame(edades)
jedad.head(2)

   edad
0  [32]
1  [24]

In [7]:
jedad["edad"] = jedad['edad'].astype(str)
jedad.head(2)

                                           edad
0  <td class="col col-ae" data-col="ae">32</td>
1  <td class="col col-ae" data-col="ae">24</td>

In [8]:
jedad['edad'] = jedad['edad'].str.extract(r'(?<=\"\>)(.*)(?=\<\/td\>)')

In [9]:
jedad.head(2)

  edad
0   32
1   24

In [10]:
pais_nac = {'pais': []}

In [11]:
productos2 = soup.find_all("td",{"class": "col-name"})

In [12]:
for i in productos2:
    pais_nac['pais'].append(i.find('img').get('title'))

In [13]:
pnac = pd.DataFrame(pais_nac)
pnac.head(2)

      pais
0  Belgium
1     None

In [14]:
paisnacimient = pnac.dropna()
paisnacimient = paisnacimient.reset_index(drop=True)
paisnacimient.head(2)

             pais
0         Belgium
1  Czech Republic

In [15]:
jugador_caract = pd.concat([jedad, paisnacimient], axis=1)
jugador_caract.head(2)

  edad            pais
0   32         Belgium
1   24  Czech Republic

In [16]:
jugador_caract.to_csv('../../data/veteranos/caracteristicas_jugadores.csv')